{
  "backend/main.mo": "Minimal Motoko backend actor with no methods or state defined.",
  "feature_evidence.json": "Feature evidence report confirming that the real business address 'Saharanpur Rd, Gangoh Khalsa, Uttar Pradesh 247341' has been implemented in both ContactSection.tsx and Footer.tsx.",
  "frontend-file-summaries.txt": "JSON document providing one-sentence summaries of each frontend source file, describing their roles in the Yameen Truck Body Maker single-page app.",
  "frontend/index.css": "Tailwind CSS entry file that imports base/components/utilities layers and defines OKLCH-based light and dark theme CSS custom properties for colors, sidebar, and chart tokens.",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting the page title to 'Yameen Truck Body Maker' and mounting the React root via main.tsx.",
  "frontend/src/App.tsx": "Root React component that assembles the full single-page layout by rendering Navigation, HeroSection, AboutSection, ServicesSection, ContactSection, and Footer in sequence.",
  "frontend/src/components/AboutSection.tsx": "About Us section component describing Yameen Truck Body Maker's expertise and values, featuring a two-column layout with descriptive text, a bullet list of key values, and a 4-card highlights grid.",
  "frontend/src/components/ContactSection.tsx": "Contact section with four info cards (phone, email, real address 'Saharanpur Rd, Gangoh Khalsa, Uttar Pradesh 247341', hours) and a validated 4-field contact form with success state.",
  "frontend/src/components/Footer.tsx": "Full-width footer displaying brand identity, quick nav links, services list, and real contact info (phone, email, address 'Saharanpur Rd, Gangoh Khalsa, Uttar Pradesh 247341') with a copyright bar.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a background image, overlays, company name heading, tagline, two CTA buttons, an animated stats row, and a scroll-down indicator.",
  "frontend/src/components/Navigation.tsx": "Responsive fixed navigation bar for the Yameen Truck Body Maker site with scroll-aware styling, smooth-scroll anchor links, and a mobile hamburger menu.",
  "frontend/src/components/ServicesSection.tsx": "Displays a grid of six truck body services (fabrication, repair, painting, fleet, steel/aluminum, hydraulics) with icons, descriptions, and feature lists.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, switching between anonymous and authenticated actors based on the current Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state across the app.",
  "frontend/src/index.css": "Global stylesheet importing Barlow fonts and Tailwind directives, defining CSS custom properties for an industrial dark theme with amber accents in both light and dark modes.",
  "frontend/src/main.tsx": "React app entry point that mounts the app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with Barlow fonts, OKLCH-based CSS variable color tokens, a custom steel gray palette, and amber accent colors, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project state (version 7) for the Yameen Truck Body Maker website, listing all implemented features such as hero section, navigation, services, contact form, industrial theme, and real contact details."
}